package com.dzf.http.api;

/**
 * @ClassName ApiParamsValueConstant
 * @Author dingmingzhong
 * @Date 2020-04-16
 * @Description: 所有的操作符都统一在这里
 */
public interface ApiParamsValueConstant {

    /**-------------------------------用户信息-----------------------------------------------------------------*/
    //登录
    int OPERATE_1_LOGIN = 1;
    //修改密码
    int OPERATE_2_CHANGE_PWD = 2;
    //扫描二维码
    int OPERATE_11_SCAN_QRCODE = 11;
    //验证二维码
    int OPERATE_12_VERIFY_QRCODE = 12;
    //上传头像
    int OPERATE_13_UPLOAD_PHOTO = 13;
    //首页，客服-获取客户信息接口
    int OPERATE_14 = 14;
    //首页-查询展示数据
    int OPERATE_15 = 15;
    //办公-代办事项条数
    int OPERATE_16 = 16;
    //密码修改-获取图片验证码
    int OPERATE_21 = 21;
    //密码修改-获取短信验证码
    int OPERATE_22 = 22;
    //密码修改-获取手机对应用户编码
    int OPERATE_23 = 23;
    //密码修改-修改密码
    int OPERATE_24 = 24;

    /**-------------------------------公共方法（及参照）---------------------------------------------------------*/
    //外勤管理-获取费用类型
    int OPERATE_10_LEGWORK_COST_CATEGORY = 10;
    //获取客户列表
    int OPERATE_101_OBTAIN_CUSTOMER_LIST = 101;
    //获取用户列表
    int OPERATE_416_OBTAIN_USER_LIST = 416;
    //获取图片流
    int OPERATE_9_OBTAIN_PHOTO_STREAM = 9;
    //首页-获取相关信息的条数
    int OPERATE_104_INDEX_OBTAIN_COUNT = 104;
    //首页-客户可扫描营业执照url前缀
    int OPERATE_105_INDEX__BL_PATH = 105;
    //客户-识别客户扫描营业执照url信息
    int OPERATE_106_INDENTIFY_BL_PATH = 106;
    //客户-保存客户营业执照扫描信息
    int OPERATE_107_SAVE_CUSTOMER_BL = 107;
    //客户-查询客户详情
    int OPERATE_108_QUERY_CUSTOMER_DETAIL = 108;
    //客户-查询扫码企业客户详情
    int OPERATE_109_OBTAIN_CUSTOMER_SCAN_LIST = 109;

    /**-------------------------------会计公司---------------------------------------------------------*/
    //获取轮播图图片路径
    int OPERATE_8_BANNER_PICTURE_PATH = 8;


    /**-------------------------------潜在客户管理---------------------------------------------------------*/
    //获取潜在客户列表
    int OPERATE_201_OBTAIN_POTENTIAL_CUSTOMER_LIST = 201;
    //跟进、放弃跟进、转为客户信息保存
    int OPERATE_203_POTENTIAL_CUSTOMER_FOLLOW_SAVE = 203;
    //潜在客户新增（修改）保存
    int OPERATE_204_POTENTIAL_CUSTOMER_ADDSAVE = 204;


    /**-------------------------------收费管理---------------------------------------------------------*/
    //获取收费登记列表
    int OPERATE_301 = 301;
    int OPERATE_302 = 302;
    int OPERATE_305_OBTAIN_COST_VER_LIST = 305;


    /**-------------------------------业务管理---------------------------------------------------------*/
    //获取业务列表
    int OPERATE_401 = 401;
    //获取业务（主表、流程）详细信息
    int OPERATE_403 = 403;
    //获取业务-客户提供资料信息
    int OPERATE_404 = 404;
    //提交下一流程
    int OPERATE_409 = 409;
    //获取申办资料（办理过程产生）信息
    int OPERATE_410 = 410;
    //业务处理-退回
    int OPERATE_412 = 412;
    //业务处理-结束
    int OPERATE_413 = 413;
    //业务处理-保存
    int OPERATE_414 = 414;
    //业务处理-保存表体信息(已废弃，与414合并)
    int OPERATE_415 = 415;
    //外勤管理-获取步骤列表
    int OPERATE_417 = 417;
    //外勤管理-获取步骤详情
    int OPERATE_418 = 418;
    //外勤管理-获取办理费用
    int OPERATE_419 = 419;
    //外勤管理-获取产生资料
    int OPERATE_420 = 420;
    //外勤管理-办理费用保存
    int OPERATE_421 = 421;
    //外勤管理-产生资料上传
    int OPERATE_422 = 422;
    //外勤管理-产生资料删除
    int OPERATE_423 = 423;
    //外勤管理-提交
    int OPERATE_424 = 424;
    //外勤管理-获取任务详情
    int OPERATE_425 = 425;
    //外勤管理-获取查询列表（旧）
    int OPERATE_426 = 426;
    //外勤管理-获取待办事项详情
    int OPERATE_427 = 427;
    //外勤管理-保存待办事项
    int OPERATE_428 = 428;
    //429.外勤管理-完成待办事项
    int OPERATE_429 = 429;
    //430.外勤管理-删除待办事项
    int OPERATE_430 = 430;
    //外勤管理-获取查询列表（新）
    int OPERATE_431 = 431;
    //外勤管理-转交待办(事项、任务)
    int OPERATE_432 = 432;

    /**-------------------------------报表---------------------------------------------------------*/
    //合同明细表
    int OPERATE_602 = 602;
    //员工工作量统计表
    int OPERATE_604 = 604;
    //代收代缴余额
    int OPERATE_605 = 605;
    //客户业务量统计
    int OPERATE_607 = 607;
    //代收代缴余额明细
    int OPERATE_608 = 608;


    /**-------------------------------管理驾驶舱---------------------------------------------------------*/
    //管理驾驶舱-合同
    int OPERATE_702 = 702;
    //管理驾驶舱-收款
    int OPERATE_703 = 703;
    //704.管理驾驶舱-员工
    int OPERATE_704 = 704;



    /**-------------------------------消息---------------------------------------------------------*/
    //意见反馈保存
    int OPERATE_801 = 801;
    //获取消息分类
    int OPERATE_802 = 802;
    //获取聊天联系人
    int OPERATE_803 = 803;
    //获取消息列表
    int OPERATE_804 = 804;
    //获取未读消息总条数(暂未使用，直接获取的分类列表未读条数)
    int OPERATE_806 = 806;
    //保存聊天图片
    int OPERATE_808 = 808;
    //删除消息
    int OPERATE_809 = 809;
    //810.消息-获取消息分类(不包含内部通知) 新版；
    int OPERATE_810 = 810;
    //811.消息-获取消息明细
    int OPERATE_811 = 811;
    //812.消息-获取消息列表(新版)
    int OPERATE_812 = 812;


    /**-------------------------------做账进度---------------------------------------------------------*/
    //1101.做账进度列表
    int OPERATE_1101 = 1101;
    //做账详情
    int OPERATE_1102 = 1102;
    //发送提醒、确认处理
    int OPERATE_1103 = 1103;
    //提醒历史(此版不用)
    int OPERATE_1105 = 1105;
    //发送激活码
    int OPERATE_1106 = 1106;


    /**-------------------------------财务处理---------------------------------------------------------*/
    //票据列表
    int OPERATE_1201 = 1201;
    /**票据详情*/
    int OPERATE_1203 = 1203;
    /**1204.票据重传*/
    int OPERATE_1204 = 1204;
    /**1205.票据退回*/
    int OPERATE_1205 = 1205;
    /**1206.票据通过*/
    int OPERATE_1206 = 1206;


    /**-------------------------------发票扫码---------------------------------------------------------*/
    //发票扫码
    int OPERATE_1301 = 1301;
    //上传票据
    int OPERATE_1302 = 1302;
    //发票扫码上传
    int OPERATE_1303 = 1303;


    /**-------------------------------资料交接---------------------------------------------------------*/
    //1401.资料交接列表-查询
    int OPERATE_1401 = 1401;
    //资料交接列表-确认
    int OPERATE_1402 = 1402;
    //1403.接手人信息
    int OPERATE_1403 = 1403;
    //1404.转交-交出确认
    int OPERATE_1404 = 1404;
    //1405.当面交
    int OPERATE_1405 = 1405;
    //1406.当面收-查询
    int OPERATE_1406 = 1406;
    //1407.当面收-确认
    int OPERATE_1407 = 1407;
    //1408.资料档案
    int OPERATE_1408 = 1408;
    //1409.添加资料（单个）
    int OPERATE_1409 = 1409;
    //1410.查询资料交接消息详情
    int OPERATE_1410 = 1410;
    //1411.消息-交接单整单确认
    int OPERATE_1411 = 1411;
    //1412.资料交接-添加多个资料（同一客户）
    int OPERATE_1412 = 1412;
    //1413.获取资料类型
    int OPERATE_1413 = 1413;


    /**-------------------------------收票---------------------------------------------------------*/
    //1501.查询收票信息（未收）
    int OPERATE_1501 = 1501;
    //1502.查询收票信息（已收）
    int OPERATE_1502 = 1502;
    //1503.获取查询期间
    int OPERATE_1503 = 1503;
    //1504.查询收票详情
    int OPERATE_1504 = 1504;
    //1505.收票保存
    int OPERATE_1505 = 1505;


    /**-------------------------------签到---------------------------------------------------------*/
    //1601.签到列表
    int OPERATE_1601 = 1601;
    //1602.签到保存
    int OPERATE_1602 = 1602;
    //1603.签到图片获取
    int OPERATE_1603 = 1603;

    /**-------------------------------工作日报---------------------------------------------------------*/
    //1701.查询日报列表
    int OPERATE_1701 = 1701;
    //1702.查询日报详情
    int OPERATE_1702 = 1702;
    //1703.保存日报
    int OPERATE_1703 = 1703;
    //1704.回复日报
    int OPERATE_1704 = 1704;


    /**-------------------------------客户拜访---------------------------------------------------------*/
    //1801.拜访列表
    int OPERATE_1801 = 1801;
    //1802.拜访详情
    int OPERATE_1802 = 1802;
    //1803.客户分类（已废弃）
    int OPERATE_1803 = 1803;
    //1804.拜访详情提交
    int OPERATE_1804 = 1804;
    //1805.拜访历史
    int OPERATE_1805 = 1805;
    //1806.客户列表
    int OPERATE_1806 = 1806;
    //1807.添加拜访提交
    int OPERATE_1807 = 1807;
}
